In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('supershops.csv')

In [3]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

# Normalization

In [4]:
#marketing spend
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MinMaxScaler.html

In [5]:
from sklearn.preprocessing import MinMaxScaler
m= MinMaxScaler()

In [6]:
df_mar = m.fit(df[['Marketing Spend']])  # trainging|calculate

In [7]:
df_mar

MinMaxScaler()

In [8]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0        114523.61       136897.80  471784.10    Dhaka  192261.83
1        162597.70       151377.59  443898.53      Ctg  191792.06
2        153441.51       101145.55  407934.54  Rangpur  191050.39
3        144372.41       118671.85  383199.62    Dhaka  182901.99
4        142107.34        91391.77  366168.42  Rangpur  166187.94

In [9]:
df[['Marketing Spend']] = m.transform(df[['Marketing Spend']]) #transforming

In [10]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617       136897.80  471784.10    Dhaka  192261.83
1         0.983359       151377.59  443898.53      Ctg  191792.06
2         0.927985       101145.55  407934.54  Rangpur  191050.39
3         0.873136       118671.85  383199.62    Dhaka  182901.99
4         0.859438        91391.77  366168.42  Rangpur  166187.94

In [11]:
#fit and transforming
df[['Administration']] = m.fit_transform(df[['Administration']]) #fit_transforming

In [12]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.692617        0.651744  471784.10    Dhaka  192261.83
1         0.983359        0.761972  443898.53      Ctg  191792.06
2         0.927985        0.379579  407934.54  Rangpur  191050.39
3         0.873136        0.512998  383199.62    Dhaka  182901.99
4         0.859438        0.305328  366168.42  Rangpur  166187.94

In [13]:
x = df.drop('Profit', axis=1)
y = df[['Profit']]

In [14]:
x1 = x.copy()
x2 = x.copy()
x3 = x.copy()
x4 = x.copy()
x5 = x.copy()
x6 = x.copy()

# Min Max Scaler using for loop
â€‹

In [15]:
#from sklearn.preprocessing import MinMaxScaler

In [16]:
#m = MinMaxScaler

In [17]:
x.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744  471784.10    Dhaka
1         0.983359        0.761972  443898.53      Ctg
2         0.927985        0.379579  407934.54  Rangpur
3         0.873136        0.512998  383199.62    Dhaka
4         0.859438        0.305328  366168.42  Rangpur

In [18]:
scaler = MinMaxScaler()
for col in x.columns:
    if pd.api.types.is_numeric_dtype(x[col]):
        x[col] = scaler.fit_transform(x[[col]])
        continue

print(x.head())

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

# #Standard Scaler

In [19]:
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.StandardScaler.html

In [20]:
from sklearn.preprocessing import StandardScaler
s= StandardScaler()

In [21]:
df_mar = s.fit(df[['Marketing Spend']]) #data training

In [22]:
df_mar

StandardScaler()

In [23]:
df[['Marketing Spend']] = s.fit_transform(df[['Marketing Spend']])  #fit_transform both

In [24]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.897913        0.651744  471784.10    Dhaka  192261.83
1         1.955860        0.761972  443898.53      Ctg  191792.06
2         1.754364        0.379579  407934.54  Rangpur  191050.39
3         1.554784        0.512998  383199.62    Dhaka  182901.99
4         1.504937        0.305328  366168.42  Rangpur  166187.94

# Max abs scaler

In [25]:
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.MaxAbsScaler.html

In [26]:
from sklearn.preprocessing import MaxAbsScaler
mx=MaxAbsScaler()

In [27]:
df_mar = mx.fit(df[['Marketing Spend']])

In [28]:
df_mar

MaxAbsScaler()

In [29]:
df[['Marketing Spend']] = mx.fit_transform(df[['Marketing Spend']])  #fit_transform both

In [30]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.445303        0.651744  471784.10    Dhaka  192261.83
1         0.969971        0.761972  443898.53      Ctg  191792.06
2         0.870043        0.379579  407934.54  Rangpur  191050.39
3         0.771065        0.512998  383199.62    Dhaka  182901.99
4         0.746344        0.305328  366168.42  Rangpur  166187.94

# Robust Scaler

In [31]:
#https://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.RobustScaler.html

In [32]:
from sklearn.preprocessing import RobustScaler
R = RobustScaler()

In [33]:
df_mar = R.fit(df[['Marketing Spend']])

In [34]:
df_mar

RobustScaler()

In [35]:
df[['Marketing Spend']] = R.fit_transform(df[['Marketing Spend']]) # fit and transfer both

In [36]:
df.head()

   Marketing Spend  Administration  Transport     Area     Profit
0         0.672530        0.651744  471784.10    Dhaka  192261.83
1         1.452113        0.761972  443898.53      Ctg  191792.06
2         1.303634        0.379579  407934.54  Rangpur  191050.39
3         1.156567        0.512998  383199.62    Dhaka  182901.99
4         1.119836        0.305328  366168.42  Rangpur  166187.94

# using for loop

In [37]:
x1 = x.copy()
x2 = x.copy()
x3 = x.copy()
x4 = x.copy()
x5 = x.copy()
x6 = x.copy()

In [38]:
x1.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

In [39]:
scaler = StandardScaler()

for col in x1.columns:
    if pd.api.types.is_numeric_dtype(x1[col]):
        x1[col] = scaler.fit_transform(x1[[col]])
        continue

print(x1.head())

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

In [40]:
x2.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

In [41]:
scaler = StandardScaler()

for col in x2.columns:
    if pd.api.types.is_numeric_dtype(x2[col]):
        x2[col] = scaler.fit_transform(x2[[col]])
        continue

print(x2.head())

   Marketing Spend  Administration  Transport     Area
0         0.897913        0.560753   2.165287    Dhaka
1         1.955860        1.082807   1.929843      Ctg
2         1.754364       -0.728257   1.626191  Rangpur
3         1.554784       -0.096365   1.417348    Dhaka
4         1.504937       -1.079919   1.273550  Rangpur

In [42]:
x3.head()

   Marketing Spend  Administration  Transport     Area
0         0.692617        0.651744   1.000000    Dhaka
1         0.983359        0.761972   0.940893      Ctg
2         0.927985        0.379579   0.864664  Rangpur
3         0.873136        0.512998   0.812235    Dhaka
4         0.859438        0.305328   0.776136  Rangpur

In [43]:
scaler = RobustScaler()

for col in x3.columns:
    if pd.api.types.is_numeric_dtype(x3[col]):
        x3[col] = scaler.fit_transform(x3[[col]])
        continue

print(x3.head())

   Marketing Spend  Administration  Transport     Area
0         0.672530        0.345355   1.552016    Dhaka
1         1.452113        0.697565   1.383714      Ctg
2         1.303634       -0.524290   1.166654  Rangpur
3         1.156567       -0.097977   1.017368    Dhaka
4         1.119836       -0.761543   0.914576  Rangpur